var num1; 
var num2;
var provinces1=["数学","信息科学与系统科学","力学","物理学"];
var cities1=[
	        ["数学史","数理逻辑与数学基础","数论","代数学","代数几何学","几何学","拓扑学","数学分析",
				"非标准分析","函数论","常微分方程","偏微分方程","动力系统","积分方程","泛函分析","计算数学","概率论",
				"数理统计学","应用统计数学","运筹学","组合数学","离散数学","模糊数学","计算机数学","应用数学","数学其他学科"],
			["信息科学与系统科学基础学科","系统学","控制理论","系统评估与可行性分析","系统工程方法论","信息科学与系统科学其他学科"],
			["基础力学","固体力学","振动与波","流体力学","流变学","爆炸力学","物理力学","生物力学","统计力学","应用力学","力学其他学科"],
			["物理学史","理论物理学","声学","热学","光学","电磁学","无线电物理","电子物理学","凝聚态物理学","等离子体物理学","原子分子物理学","原子核物理学","高能物理学","计算物理学","应用物理学","物理学其他学科"]
];
var countires=[
	[
		["数学史"],
		["演绎逻辑学","证明论","递归论","模型论","公理集合论","数学基础","数理逻辑与数学基础其他学科"],
		["初等数论","解析数论","代数数论","超越数论","丢番图逼近","数的几何","概率数论","计算数论","数论其他学科"],
		["线性代数","群论","域论","李群","李代数","Kac-Moody代数","环论","模论","格论","泛代数理论","范畴论","同调代数","代数K理论","微分代数","代数编码理论","代数学其他学科"],
		["代数几何学"],
		[,"几何学基础","欧氏几何学","非欧几何学","球面几何学","向量和张量分析","仿射几何学","射影几何学","微分几何学","分数维几何","计算几何学","几何学其他学科"],
		["拓扑学","点集拓扑学","代数拓扑学","同伦论","低维拓扑学","同调论","维数论","格上拓扑学","纤维丛论","几何拓扑学","奇点理论","微分拓扑学","拓扑学其他学科"],
		["微分学","积分学","级数论","数学分析其他学科"],
		["非标准分析"],
		["实变函数论","单复变函数论","多复变函数论","函数逼近论","调和分析","复流形","特殊函数论","函数论其他学科"],
		["定性理论","稳定性理论","解析理论","常微分方程其他学科"],
		["椭圆型偏微分方程","双曲型偏微分方程","抛物型偏微分方程","非线性偏微分方程","偏微分方程其他学科"],
		["微分动力系统","拓扑动力系统","复动力系统","动力系统其他学科"],
		["积分方程"],
		["线性算子理论","变分法","拓扑线性空间","希尔伯特空间","函数空间","巴拿赫空间","算子代数","测度与积分","广义函数论","非线性泛函分析","泛函分析其他学科"],
		["常微分方程数值解","偏微分方程数值解","积分变换与积分方程数值方法","数值代数","优化计算方法","数值逼近与计算几何","随机数值方法与统计计算","并行计算算法",
			"误差分析与区间算法","小波分析与傅立叶分析的数值方法","反问题计算方法","符号计算与计算机推理","计算数学其他学科"],
		["几何概率","概率分布","极限理论","随机过程","马尔可夫过程","随机分析","鞅论","应用概率论","概率论其他学科"],
		["抽样理论","假设检验","非参数统计","方差分析","相关回归分析","统计推断","贝叶斯统计","试验设计","多元分析","统计判决理论","时间序列分析","空间统计","数理统计学其他学科"],
		["统计质量控制","可靠性数学","保险数学","统计计算","统计模拟","应用统计数学其他学科"],
		["线性规划","非线性规划","动态规划","组合最优化","参数规划","整数规划","随机规划","排队论","对策论","库存论","决策论","搜索论","图论","统筹论","最优化","运筹学其他学科"],
		["组合数学"],
		["离散数学"],
		["模糊数学"],
		["计算机数学"],
		["应用数学"],
		["数学其他学科"]
	],
	[
		["信息论","控制论","系统论","信息科学与系统科学基础学科其他学科","运筹学"],
		["微分动力系统","混沌","一般系统论","耗散结构理论","协同学","突变论","超循环论","复杂系统与复杂性科学","系统学其他学科"],
		["大系统理论","系统辨识","状态估计","鲁棒控制","控制理论其他学科"],
		["系统评估与可行性分析"],
		["系统建模","决策分析","决策支持系统","管理信息系统","系统工程方法论其他学科"],
		["信息科学与系统科学其他学科"]	
	],
	[
		["理论力学","理性力学","非线性力学","连续介质力学","摩擦学","柔性多体力学","陀螺力学","飞行力学","基础力学其他学科"],
		["弹性力学","塑性力学","粘弹性、粘塑性力学","蠕变","界面力学与表面力学","疲劳","损伤力学","断裂力学","散体力学","细观力学","微观力学","电磁固体力学","材料力学",
	    	"结构力学","计算固体力学","实验固体力学","固体力学其他学科"],
	    ["线性振动力学","非线性振动力学","弹性体振动力学","随机振动力学","振动控制理论","固体中的波","流体—固体耦合振动","振动与波其他学科"],
	    ["理论流体力学","水动力学","气体动力学","空气动力学","悬浮体力学","湍流理论","粘性流体力学","多相流体力学","渗流力学","物理—化学流体力学",
	    	"等离子体动力学","电磁流体力学","非牛顿流体力学","流体机械流体力学","旋转与分层流体力学","辐射流体力学","计算流体力学","实验流体力学","环境流体力学","微流体力学","流体力学其他学科"],
	    ["流变学"],
	    ["爆轰与爆燃理论","爆炸波、冲击波、应力波","高速碰撞动力学","爆炸力学其他学科"],
	    ["高压固体物理力学","稠密流体物理力学","高温气体物理力学","多相介质物理力学","临界现象与相变","原子与分子动力学","物理力学其他学科"],
	    ["生物流体力学","生物流变学"],
	    ["统计力学"],
	    ["应用力学"],
	    ["力学其他学科"]
	],
	[
		["物理学史"],
		["数学物理","电磁场理论","经典场论","相对论","量子力学","统计物理学","理论物理学其他学科"],
		["普通线性声学","非线性声学","流体动力声学","超声学、量子声学和声学效应","次声学","水声和海洋声学","结构声学和振动","噪声、噪声效应及其控制","建筑声学与电声学",
	    	"声学信号处理","生理、心理声学和生物声学","语言声学和语音信号处理","音乐声学","声学换能器、声学测量及方法","声学测量方法","声学材料","信息科学中的声学问题",
	    	"与声学有关的其它物理问题和交叉学科"],
	    ["热力学","热物性学","传热学","热学其他学科"],
	    ["几何光学","物理光学","非线性光学","光谱学","量子光学","信息光学","导波光学","发光学","红外物理","激光物理","光子学与集成光学","应用光学","大气光学",
	    	"环境光学","海洋光学","光学遥感","超快激光及应用","光学其他学科"],
	    ["电学","磁学","静电学","静磁学","电动力学","电磁学其他学科"],
	    ["电磁波物理","量子无线电物理","微波物理学","超高频无线电物理","统计无线电物理","无线电物理其他学科"],
	    ["量子电子学","电子离子与真空物理","带电粒子光学","电子物理学其他学科"],
	    ["凝聚态理论","金属物理学","半导体物理学","电介质物理学","晶体学","非晶态物理学","软物质物理学","薄膜物理学","低维物理","表面与界面物理学",
	    	"固体发光","磁学","超导物理学","低温物理学","高压物理学","摩擦学","介观物理学","量子调控","凝聚态物理学其他学科"],
	    ["热核聚变等离子体物理学","低温等离子体物理学","等离子体诊断学","凝聚态等离子体物理学","等离子体物理学其他学科"],
	    ["原子与分子理论","原子光谱学","分子光谱学","波谱学","原子与分子碰撞过程","玻色—爱因斯坦凝聚和冷原子物理","原子分子物理学其他学科"],
	    ["核结构","核能谱学","低能核反应","中子物理学","裂变物理学","聚变物理学","轻粒子核物理学","重离子核物理学","中高能核物理学","原子核物理学其他学科"],
	    ["粒子物理学","宇宙线物理学","粒子加速器物理学","高能物理实验","粒子宇宙学","高能物理学其他学科"],
	    ["计算物理学"],
	    ["应用物理学"],
	    ["物理学其他学科"]
	]
	];
$(function(){
    for(var i=0;i<provinces1.length;i++){
    	
    $("#province").append("<option>"+provinces1[i]+"</option>");
    }
    $("#province").change(function(){
        $("#xueke").children().not(":eq(0)").remove();
        num1=$(this).children("option:selected").index();
        var acity1=cities1[num1-1];
        for(var j=0;j<acity1.length;j++){
        $("#xueke").append("<option>"+acity1[j]+"</option>");
        }
    $("#xueke").change(function(){
        $("#country").children().not(":eq(0)").remove();
        num2=$(this).children("option:selected").index();
        var contries1=countires[num1-1][num2-1];
        for( var z=0;z<contries1.length;z++){
        $("#country").append("<option>"+contries1[z]+"</option>");
        }
        });
        });
    });